stephaniekwak/app/controllers/home_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT "ingredients".* FROM "ingredients"
---
  def index
    @recipes = Recipe.all
    @ingredients = Ingredient.all