stephaniekwak/app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-09 21:42:38.598355"], ["name", "chicken"], ["updated_at", "2014-11-09 21:42:38.598355"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)
    if @ingredient.save

SELECT  "ingredients".* FROM "ingredients"  WHERE "ingredients"."id" = $1 LIMIT 1  [["id", 8]]
---
  def find_ingredient
    @ingredient = Ingredient.find(params[:id])