stephaniekwak/app/controllers/recipes_controller.rb

  def new
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def edit
    find_recipe
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

  def update
    find_recipe
    #this works for non-ingredients but doesn't use the RecipeForm model
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = $1, "updated_at" = $2 WHERE "recipes"."id" = 214  [["title", "3wwerwrwr"], ["updated_at", "2014-11-10 06:18:47.636931"]]