stephaniekwak/app/views/recipes/edit.html.erb

SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 24]]
---
    <ul>
      <% @recipe.ingredients.each do |ingredient| %>