stephaniekwak/app/views/recipes/new.html.erb

SELECT "ingredients".* FROM "ingredients"
---
  <% @ingredients.each do |ingredient| %>
    <li><%= check_box_tag "recipe_form[ingredients][][ingredient_id]", ingredient.id, @recipe.ingredients.include?(ingredient) %>